# a = int(input('Количество учащихся в 1 классе: '))
# b = int(input('Количество учащихся в 2 классе: '))
# c = int(input('Количество учащихся в 3 классе: '))

# part1 = (a + 1) // 2
# part2 = (b + 1) // 2
# part3 = (c + 1) // 2

# print(part1 + part2 + part3) 


#print(((a + 1) // 2) + ((b + 1) // 2) + ((c + 1) // 2))

# i = int(input('В какой вагон вы сели: '))
# j = int(input('Какой вагон указан: '))

# if i == j:
#     print("Невозможно узнать количество вагонов")
# else:
#     print(f"Общее количество вагонов: {i + j - 1}")



# n = int(input('Введите год '))
# if n % 4 == 0 and n % 100 != 0 or n % 400 == 0:
#     print('YES')
# else:
#     print('NO')

    
i = input("Введите трехзначное число: ")
print(int(i[0])+int(i[1])+int(i[2]))









